// 21. Программа проверяет пятизначное число на палиндромом.
Console.WriteLine("Введите пятизначное число: ");
int number = int.Parse(Console.ReadLine());

if(number/10000 == number%10 && number/1000%10 == number%100/10)
{
    Console.WriteLine("Число является палиндромом");
}
else
{
    Console.WriteLine("Число не является палиндромом");
}

// number/10000 - первая цифра пятизначного числа
// number%10 - последняя цифра пятизначного числа
// number/1000%10 - вторая цифра пятизначного числа
// number%100/10 - четвёртая цифра пятизначного числа