// 46. Написать программу масштабирования фигуры
//Тут для тех кто далеко улетел, чтобы задавались вершины фигуры списком (одной строкой)
//например: "(0,0) (2,0) (2,2) (0,2)"
//коэффициент масштабирования k задавался отдельно - 2 или 4 или 0.5
//В результате показать координаты, которые получатся.
//при k = 2 получаем "(0,0) (4,0) (4,4) (0,4)"
Console.WriteLine("Введите координаты фигуры");
string text = Console.ReadLine();
int [] array = new int [8];
int count = 0;
for (int i = 0; i < text.Length; i++)
{
    char b = text[i];
    if ()
}