// 5. Написать программу вычисления значения функции y = f(a)
int a = 3;
int f = a*a*a;
Console.WriteLine(f);
int y = f;
Console.WriteLine(y);