// 16. Дано число обозначающее день недели. Выяснить является номер дня недели выходным 
Console.WriteLine("Введите число");
int C = int.Parse(WriteLine());
